/* No comment provided by engineer. */
"%@ to %@" = "%1$@ ถึง %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$dวัน of %2$dวัน";

/* No comment provided by engineer. */
"%i to %i" = "%1$i ถึง %2$i";

/* No comment provided by engineer. */
"'%@' accumulate attribute is invalid." = "'%@' ข้อมูลการรวบรวมเชิงบรรยายไม่ถูกต้อง";

/* No comment provided by engineer. */
"'%@' is an invalid directions time attribute." = "'%@' เป็นข้อมูลเวลาเชิงบรรยายที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"'%@' is an invalid impedance attribute." = "'%@' เป็นคุณลักษณะการต้านทานที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"'%@' restriction attribute is invalid." = "'%@' ข้อมูลข้อกำหนดเชิงบรรยายไม่ถูกต้อง";

/* No comment provided by engineer. */
"'item' parameter required" = "‘รายการ’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'portal' parameter required" = "‘พอร์ทัล’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'tags' parameter required" = "‘เท็ก’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'title' parameter required" = "‘ชื่อ’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<ไม่มีค่า>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "การเข้าสู่ตำแหน่งของอุปกรณ์ถูกปฏิเสธ";

/* No comment provided by engineer. */
"Actual Size" = "ขนาดจริง";

/* No comment provided by engineer. */
"Add" = "เพิ่ม";

/* No comment provided by engineer. */
"Add Attachment" = "เพิ่มไฟล์แนบ";

/* No comment provided by engineer. */
"Add..." = "เพิ่ม...";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "รหัสรายการเป็นสิ่งจำเป็นสำหรับการดำเนินการนี้ เพิ่มรายการนี้ไปยังพอร์ทัลที่จะได้รับ Itemid";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "NSException ถูกตรวจพบ แต่ข้อมูลเดิมและคอลสเต๊กไม่สามารถใช้ได้ เบรคข้อยกเว้น Objective-C เพื่อดูบรรทัดของรหัสที่ก่อให้เกิด NSException เดิม สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีการทำเช่นนี้โปรดดูเอกสาร";

/* No comment provided by engineer. */
"Apply Geometry" = "ใช้ระบบเรขาคณิต";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "อย่างน้อย 1 สถานที่จำเป็นในการแก้เส้นทาง";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "อย่างน้อย 1 เหตุการณ์ที่เกิดขึ้นเป็นสิ่งจำเป็นที่จะแก้ปัญหาเส้นทาง";

/* No comment provided by engineer. */
"Attachment" = "เอกสารแนบ";

/* No comment provided by engineer. */
"Attachments" = "แนบ";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "พยายามที่จะใช้ฟังก์ชั่นที่ไม่ได้รับการสนับสนุนสำหรับระดับใบอนุญาตในปัจจุบัน";

/* No comment provided by engineer. */
"Authorization required" = "ต้องได้รับอนุญาต";

/* No comment provided by engineer. */
"Bad Request" = "คำขอเสีย";

/* No comment provided by engineer. */
"Bad URL." = "URL เสีย";

/* No comment provided by engineer. */
"bytes" = "ไบต์";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "ไม่สามารถบันทึกลงในไอเท็มประเภทที่แตกต่างกันได้";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "ไม่สามารถตรวจสอบตัวตนของ '%@'";

/* No comment provided by engineer. */
"Certificate Required" = "ต้องการใบรับรอง";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "ความท้าทายสำหรับ URL:%1$@ กับเคาล้มเหลว:%2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "เปลี่ยนประเภทฟีเจอร์";

/* No comment provided by engineer. */
"Choose From Library" = "เลือกจากคลังภาพ";

/* No comment provided by engineer. */
"Clear" = "เคลียร์";

/* No comment provided by engineer. */
"Clear Geometry" = "ลบรูปเรขาคณิต";

/* No comment provided by engineer. */
"Continue" = "ต่อไป";

/* No comment provided by engineer. */
"Created %d hours ago" = "สร้างเมื่อ %d ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created %d minutes ago" = "สร้างเมื่อ %d นาทีที่แล้ว";

/* No comment provided by engineer. */
"Created a minute ago" = "สร้างเมื่อไม่กี่นาทีที่แล้ว";

/* No comment provided by engineer. */
"Created an hour ago" = "สร้างเมื่อไม่กี่ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created by %@" = "สร้างโดย %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "สร้างขึ้นโดย%1$@ %2$d ชั่วโมงที่ผ่านมา";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "สร้างขึ้นโดย%1$@ %2$d นาทีที่ผ่านมา";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "สร้างโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "สร้างโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "สร้างขึ้นโดย%1$@ บน%2$@ ที่%3$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "สร้างขึ้นโดย%1$@ บน%2$@ ที่%3$@ - วัน";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "สร้างโดย %@ วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "สร้างเมื่อ%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "สร้างเมื่อ%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created seconds ago" = "สร้างเมื่อไม่กี่วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Credential Required" = "ชื่อและรหัสผ่านที่ต้องใช้";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "ข้อมูลสำหรับแผนภูมิวงกลมไม่ถูกต้อง";

/* No comment provided by engineer. */
"Delete" = "ลบ";

/* No comment provided by engineer. */
"Delete Attachment" = "ลบเอกสารแนบ";

/* No comment provided by engineer. */
"Delete Feature" = "ลบฟีเจอร์";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "การลบสิ่งที่แนบมานี้จะเอามันออกไปจากแหล่งข้อมูลที่เกี่ยวข้องและป๊อปอัพ";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "การลบคุณลักษณะนี้จะเอามันออกไปจากแผนที่และเชื่อมโยงแหล่งข้อมูล";

/* No comment provided by engineer. */
"Directions distance attribute is invalid." = "ข้อมูลระยะทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "ข้อมูลเวลาทิศทางและระยะไม่ตรงกัน";

/* No comment provided by engineer. */
"Edit" = "แก้ไข";

/* No comment provided by engineer. */
"Edited %d hours ago" = "แก้ไขเมื่อ %d ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "แก้ไขเมื่อ %d นาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited a minute ago" = "แก้เมื่อนาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited an hour ago" = "แก้ไขเมื่อชั่่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@" = "แก้ไขโดย %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "เรียบเรียงข้อมูลโดย%1$@ %2$d ชั่วโมงที่ผ่านมา";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "เรียบเรียงข้อมูลโดย%1$@ %2$d นาทีที่ผ่านมา";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "แก้ไขโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "แก้ไขโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "เรียบเรียงข้อมูลโดย%1$@ บน%2$@ ที่%3$@ - วัน";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "เรียบเรียงข้อมูลโดย%1$@ บน%2$@ ที่%3$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "แก้ไขโดย %@ วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "แก้ไขใน%1$@ ที่%2$@ - วัน";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "แก้ไขใน%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Edited seconds ago" = "แก้ไขเมื่อวินาทีที่แล้ว";

/* No comment provided by engineer. */
"Empty username/password" = "ชื่อผู้ใช้/รหัสผ่านว่างเปล่า";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "ใส่ตัวเลขระหว่าง%1$@ และ%2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "ใส่ตัวเลขระหว่าง%1$i และ%2$i";

/* No comment provided by engineer. */
"Error" = "ข้อผิดพลาด";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "การเพิ่มลักษณะให้คีย์เชนผิดพลาด";

/* No comment provided by engineer. */
"Error adding keychain item" = "ข้อผิดพลาดในการเพิ่มรายการพวงกุญแจ";

/* No comment provided by engineer. */
"Error extracting identity" = "ข้อผิดพลาดการแยกลักษณะ";

/* No comment provided by engineer. */
"Error Loading Page" = "ข้อผิดพลาดในการโหลดหน้าเว็บ";

/* No comment provided by engineer. */
"Error removing keychain item" = "ข้อผิดพลาดในการลบรายการพวงกุญแจ";

/* No comment provided by engineer. */
"Error updating keychain item" = "ข้อผิดพลาดรายการปรับปรุงพวงกุญแจ";

/* No comment provided by engineer. */
"Extra Large" = "ใหญ่พิเศษ";

/* No comment provided by engineer. */
"Facility (%@) has invalid added cost attribute name(s): %@" = "สิ่งอำนวยความสะดวก (%1$@) ได้ไม่ถูกต้องเพิ่มค่าใช้จ่ายในชื่อแอตทริบิวต์ (s):%2$@";

/* No comment provided by engineer. */
"Facility (%@) has invalid impedance cutoff." = "สิ่งอำนวยความสะดวก (%@) มีความต้านทานการตัดที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Facility (%@) has negative added cost attribute: %@" = "สิ่งอำนวยความสะดวก (%1$@) มีค่าอุปสรรคในตารางเป็นลบ: %2$@";

/* No comment provided by engineer. */
"Facility (%@) has null geometry." = "สิ่งอำนวยความสะดวก (%@) ไม่มีรูปทรงเรขาคณิต";

/* No comment provided by engineer. */
"Feature isn't valid." = "คุณลักษณะที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Finish" = "จบ";

/* No comment provided by engineer. */
"Finishing editing..." = "จบการแก้ไข ...";

/* No comment provided by engineer. */
"GB" = "กิกะไบต์";

/* No comment provided by engineer. */
"Geometry" = "เรขาคณิต";

/* No comment provided by engineer. */
"Hide" = "ซ่อน";

/* No comment provided by engineer. */
"Incident (%@) has a null geometry." = "เหตุการณ์ที่เกิดขึ้น (%@) ไม่มีรูปทรงเรขาคณิต";

/* No comment provided by engineer. */
"Incident (%@) has invalid added cost attribute name(s): %@" = "เหตุการณ์ที่เกิดขึ้น (%1$@) มีค่าใช้จ่ายเพิ่มไม่ถูกต้องชื่อแอตทริบิวต์ (s):%2$@";

/* No comment provided by engineer. */
"Incident (%@) has invalid impedance cutoff." = "เหตุการณ์ที่เกิดขึ้น (%@) มีความต้านทานการตัดที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Incident (%@) has less than 1 target facility count." = "เหตุการณ์ที่เกิดขึ้น (%@) มีสิ่งอำนวยความสะดวกนับน้อยกว่า 1 เป้าหมาย";

/* No comment provided by engineer. */
"Incident (%@) has negative added cost attribute: %@" = "เหตุการณ์ที่เกิดขึ้น (%1$@) มีค่าอุปสรรคในตารางเป็นลบ: %2$@";

/* No comment provided by engineer. */
"Insert Part" = "แทรกส่วน";

/* No comment provided by engineer. */
"Insert Vertex" = "แทรกจุดเชื่อมต่อ";

/* No comment provided by engineer. */
"Insufficient number of stops." = "จำนวนจุดหยุดไม่เพียงพอ";

/* No comment provided by engineer. */
"Invalid attribute parameter attribute name (%@)." = "ชื่อข้อมูลตัวแปรไม่ถูกต้อง (%@).";

/* No comment provided by engineer. */
"Invalid attribute parameter parameter name (%@)." = "ชื่อข้อมูลตัวแปรไม่ถูกต้อง (%@).";

/* No comment provided by engineer. */
"Invalid Credentials" = "ข้อมูลส่วนตัวใช้ไม่ได้";

/* No comment provided by engineer. */
"Invalid default impedance cutoff." = "ตัดความต้านทานเริ่มต้นไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid default target facility count." = "เริ่มต้นไม่ถูกต้องนับสถานที่เป้าหมาย";

/* No comment provided by engineer. */
"Invalid GPX data." = "ข้อมูล GPX ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid groupID." = "groupID ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid polygon buffer distance." = "ระยะบัฟเฟอร์ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "ค่ากำหนดการใช้ไม่ถูกต้องสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";

/* No comment provided by engineer. */
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "ประเภทค่าไม่ถูกต้องสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";

/* No comment provided by engineer. */
"KB" = "กิโลไบต์";

/* No comment provided by engineer. */
"Keep Current Values" = "เก็บค่าปัจจุบัน";

/* No comment provided by engineer. */
"Large" = "ใหญ่";

/* No comment provided by engineer. */
"Line barrier (%@) does not cover any network elements." = "Line barrier (%@) ไม่ครอบคลุมส่วนประกอบเน็ตเวิร์คใดๆ";

/* No comment provided by engineer. */
"Line barrier (%@) has invalid scaled cost attribute name." = "Line barrier (%@) มีชื่อข้อมูลมาตราส่วนเชิงบรรยายไม่ถูกต้อง";

/* No comment provided by engineer. */
"Loading feature..." = "กำลังโหลดฟีเจอร์…";

/* No comment provided by engineer. */
"MB" = "เมกะไบต์";

/* No comment provided by engineer. */
"Medium" = "กลาง";

/* No comment provided by engineer. */
"Missing client certificate" = "ใบรับรองผู้ใช้งานที่หายไป";

/* string to represent hyperlink attributes */
"More Info" = "ข้อมูลเพิ่มเติม";

/* No comment provided by engineer. */
"Move Geometry" = "ย้ายรูปทรงเลขา";

/* No comment provided by engineer. */
"Move Part" = "ย้ายบางส่วน";

/* No comment provided by engineer. */
"Move Vertex" = "ย้ายจุดเชื่อมต่อ";

/* No comment provided by engineer. */
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "ค่ากำหนดการใช้งานเป็นกลางสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "ไม่พบใบรับรองในการเข้าถึงแหล่งที่มาข้อมูล '%@'";

/* No comment provided by engineer. */
"No data to create a bar chart" = "ไม่มีข้อมูลที่จะสร้างแผนภูมิแท่ง";

/* No comment provided by engineer. */
"No data to create a line chart" = "ไม่มีข้อมูลที่จะสร้างแผนภูมิเส้น";

/* No comment provided by engineer. */
"No data to create a pie chart" = "ไม่มีข้อมูลสำหรับสร้างแผนภูมิวงกลม";

/* No comment provided by engineer. */
"No image to display" = "ไม่มีภาพที่จะแสดง";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "ไม่พบเส้นทางระหว่างจุดต่างๆที่ให้มา (%@).";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "วัตถุที่ไม่สามารถสร้างได้โดยไม่ต้องพอร์ทัล ใช้ fromJSON: ด้วยประตู: ข้อผิดพลาด: วิธีการแทน";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* No comment provided by engineer. */
"Open" = "เปิด";

/* No comment provided by engineer. */
"Open in Safari" = "เปิดใน Safari";

/* No comment provided by engineer. */
"Password" = "รหัสผ่าน";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "กรุณาใส่ชื่อสำหรับสิ่งที่แนบมาใหม่";

/* No comment provided by engineer. */
"Point barrer (%@) was not located." = "Point barrier (%@) ไม่ได้ถูกระบุตำแหน่ง";

/* No comment provided by engineer. */
"Point barrier (%@) has invalid added cost attribute name." = "Point barrier (%@) มีชื่อข้อมูลเชิงบรรยายไม่ถูกต้อง";

/* No comment provided by engineer. */
"Point barrier (%@) has null geometry." = "จุดอุปสรรค (%@) ไม่มีรูปทรงเรขา";

/* No comment provided by engineer. */
"Polygon barrier (%@) does not cover any network elements." = "Polygon barrier (%@) ไม่ครอบคลุมส่วนประกอบเน็ตเวิร์คใดๆ";

/* No comment provided by engineer. */
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygon barrier (%@) มีชื่อข้อมูลมาตราส่วนเชิงบรรยายไม่ถูกต้อง";

/* No comment provided by engineer. */
"Polygon barrier (%@) has non positive scaled cost attribute." = "พื้นที่รูปปิด (%@)";

/* No comment provided by engineer. */
"Polygon barrier (%@) has null geometry." = "พื้นที่รูปปิด (%@) ไม่มีรูปทรงเลขา";

/* No comment provided by engineer. */
"Polyline barrier (%@) has non positive scaled cost attribute." = "เส้นจำนวนมาก (%@)มีที่ไม่บวกค่าใช้จ่ายในการปรับขนาดแอตทริบิวต์";

/* No comment provided by engineer. */
"Polyline barrier (%@) has null geometry." = "เส้นจำนวนมาก (%@)ไม่มีรูปทรงเลขา";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "เส้นจำนวนมากไม่กลับมา";

/* No comment provided by engineer. */
"Remove Part" = "ลบบางส่วนออก";

/* No comment provided by engineer. */
"Remove Vertex" = "ลบเวอเท็กซ์";

/* No comment provided by engineer. */
"Reset to Default Values" = "รีเซ็ตไปที่ค่าเริ่มต้น";

/* No comment provided by engineer. */
"Retry" = "ลองใหม่";

/* No comment provided by engineer. */
"Save To Photo Library" = "บันทึกในคลังภาพ";

/* No comment provided by engineer. */
"Sign In" = "ลงชื่อเข้าใช้";

/* No comment provided by engineer. */
"Skip" = "ข้ามไป";

/* No comment provided by engineer. */
"Small" = "เล็ก";

/* No comment provided by engineer. */
"Soft restricted element (%@) was traversed." = "องค์ประกอบการกำหนดขอบเขต (%@) ได้รับการสำรวจ";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "วันเวลาเริ่มต้นที่ระบุเกิดขึ้นก่อนวันที่ 1 มกราคม ปี ค.ศ. 1970";

/* No comment provided by engineer. */
"Stop (%@) has a time window end that occurs before its time window start." = "หยุด (%@) เมื่อหน้าต่างสิ้นสุดการทำงานซึ่งจะแสดงขึ้นก่อนที่หน้าต่างจะเริ่มทำงาน";

/* No comment provided by engineer. */
"Stop (%@) has a time window that starts before January 1, 1970." = "หยุด (%@) มีหน้าต่างเวลาที่เริ่มต้นก่อนที่ 1 มกราคม 1970";

/* No comment provided by engineer. */
"Stop (%@) has invalid added cost." = "หยุด (%@) มีค่าใช้จ่ายเพิ่มที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Stop (%@) has null geometry." = "หยุด (%@) มีรูปทรงเรขาคณิต";

/* No comment provided by engineer. */
"Stop (%@) is located on a non traversable element." = "จุด (%@) ถูกวางอยู่บนส่วนประกอบที่ย้ายข้ามไม่ได้";

/* No comment provided by engineer. */
"Stop (%@) is located on a soft restricted element." = "จุด (%@) ถูกวางอยู่บนส่วนประกอบที่เข้มงวด";

/* No comment provided by engineer. */
"Stop (%@) is unreachable." = "หยุด (%@) ไม่สามารถเข้าถึง";

/* No comment provided by engineer. */
"Stop (%@) was not located." = "จุด (%@) ยังไม่ได้ถูกระบุตำแหน่ง";

/* No comment provided by engineer. */
"Take Photo or Video" = "ถ่ายรูปภาพหรือวิดิโอ";

/* No comment provided by engineer. */
"The directions language is invalid." = "ภาษาทิศทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "ข้อมูลประเภทถนนไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions style is invalid." = "สไตล์ทิศทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "ระบบพิกัดของข้อมูลนำเข้าไม่ได้ถูกระบุ";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "เน็ตเวิร์คไม่มีข้อมูลลำดับศักดิ์สำหรับการวางแผนเส้นทางตามลำดับศักดิ์";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "ข้อมูลนี้ต้องบันทึกไว้ในพอร์ทัลโดยใช้การ 'saveAs:' เสียก่อนในครั้งแรก";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "ระบบพิกัดของผลลัพธ์ไม่ได้ถูกระบุ";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "แหล่งที่มาข้อมูลที่คุณกำลังมองหาอาจจะถูกลบออก มีการเปลี่ยนชื่อหรือไม่สามารถใช้ได้ชั่วคราว";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "ใบรับรองของเซิร์ฟเวอร์ไม่ถูกต้อง คุณอาจมีการเชื่อมต่อกับเซิร์ฟเวอร์ที่เป็น '%@' ซึ่งทำให้การวางข้อมูลที่มีความลับของคุณลงไปมีความเสี่ยง คุณต้องการที่จะเชื่อมต่อไปหรือไม่?";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "ClientID ที่ระบุไม่ถูกต้อง";

/* No comment provided by engineer. */
"The walking mode route is too large." = "โหมดเส้นทางการการเดินกว้างเกินไป";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "เกิดข้อผิดพลาดในการโหลดคุณลักษณะเป็น กรุณาตรวจสอบการเชื่อมต่อเครือข่ายของคุณ";

/* No comment provided by engineer. */
"Time windows with non time impedance." = "หน้าต่างเวลาที่มีความต้านทานไม่ใช่เวลา";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "ในการบันทึกเป็นรายการใหม่ คุณต้องลงทะเบียนเข้าสู่ระบบพอร์ทัล";

/* No comment provided by engineer. */
"Today" = "วันนี้";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Token ไม่ถูกต้องหรือหมดอายุ";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "Token URL ว่างเปล่า คุณต้องใส่ Token URL ที่ถูกต้อง";

/* No comment provided by engineer. */
"Unauthorized access" = "การเข้าถึงไม่ได้รับอนุญาต";

/* No comment provided by engineer. */
"Unknown authentication error" = "ข้อผิดพลาดการพิสูจน์ที่ไม่ทราบสาเหตุ";

/* No comment provided by engineer. */
"Unknown condition." = "เงื่อนไขที่ไม่รู้จัก";

/* No comment provided by engineer. */
"Unknown error occurred" = "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ";

/* No comment provided by engineer. */
"Unsupported GPX data." = "ไม่รองรับข้อมูล GPX";

/* No comment provided by engineer. */
"Unsupported search where clause." = "ไม่รองรับการค้นหาด้วยสถานที่";

/* No comment provided by engineer. */
"User canceled error" = "ผู้ใช้ยกเลิกเกิดข้อผิดพลาด";

/* No comment provided by engineer. */
"Username" = "ชื่อผู้ใช้งาน";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "โดยใช้เบราว์เซอร์ในการตรวจสอบ…";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "คุ้มค่าเกินความยาวสูงสุดของสนาม%lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "คุณกำลังจะเปลี่ยนประเภทของข้อมูล คุณต้องการที่จะเก็บค่าปัจจุบันของคุณ (ที่เป็นไปได้) หรือรีเซ็ตเป็นค่าเริ่มต้น?";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "คุณไม่ได้มีสิทธิ์ในการเข้าถึงแหล่งข้อมูลนี้";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "คุณต้องลงทะเบียนไปยังพอร์ทัลเพื่อการดำเนินการนี้";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "คุณจะต้องระบุให้คะแนนระหว่าง 1 และ 5";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "คุณต้องระบุคีย์คำอธิบายการใช้งานที่ตั้ง (NSLocationWhenInUseUsageDescription หรือ NSLocationAlwaysUsageDescription) ใน plist ของคุณ";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "คุณต้องเลือกใบรับรองเพื่อเข้าถึงแหล่งที่มาข้อมูล'%@'";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "คุณจำเป็นต้องเข้าสู่ระบบเพื่อเข้าถึงแหล่งที่มาข้อมูล'%@'";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "ซม.";
"dd" = "ว";
"dm" = "dm";
"ft" = "ft";
"in" = "ใน";
"km" = "กม.";
"m" = "ม.";
"mi" = "ไมล์";
"mm" = "มม.";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "ไม่ทราบ";
"yd" = "ป ด";

/* Unit Display Strings */
"Centimeters" = "เซ็นติเมตร";
"Decimal Degrees" = "เดซิมอล ดีกรี";
"Decimeters" = "เดซิเมตร";
"Feet" = "ฟุต";
"Inches" = "นิ้ว";
"Kilometers" = "กิโลเมตร";
"Meters" = "เมตร";
"Miles" = "ไมล์";
"Millimeters" = "มิลลิเมตร";
"Nautical Miles" = "ไมล์ทะเล";
"Points" = "จุด";
"Yards" = "หลา";

/* Area Units Abbreviated Strings */
"sq. in" = "ตร.น.";
"sq. ft" = "ตร.ฟ.";
"sq. yd" = "ตร.หลา";
"ac" = "เอเคอร์";
"sq. mi" = "ตร.ไมล์";
"sq. mm" = "ตร.มม.";
"sq. cm" = "ตร.ซม.";
"sq. dm" = "ตร.ดม.";
"sq. m" = "ตร.ม.";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "ตร.กม.";

/* Area Units Display Strings */
"Square Inches" = "ตารางนิ้ว";
"Square Feet" = "ตารางฟุต";
"Square Yards" = "ตารางหลา";
"Acres" = "เอเคอร์";
"Square Miles" = "ตารางไมล์";
"Square Millimeters" = "ตารางมิลลิเมตร";
"Square Centimeters" = "ตารางเซนติเมตร";
"Square Decimeters" = "ตารางเดซิเมตร";
"Square Meters" = "ตารางเมตร";
"Ares" = "Ares";
"Hectares" = "เฮกตาร์";
"Square Kilometers" = "ตารางกิโลเมตร";

